       IDENTIFICATION DIVISION.
       PROGRAM-ID. PAYMENT.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AMOUNT             PIC 9(7)V99.

       PROCEDURE DIVISION.
           DISPLAY "PAYMENT PROGRAM".
           GOBACK.
