       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUSTOMER. eddie hey

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CUSTOMER-ID        PIC X(10). new

       PROCEDURE DIVISION.
           DISPLAY "CUSTOMER PROGRAM".
           GOBACK.
