       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUSTOMER. eddie

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CUSTOMER-ID        PIC X(10).ss

       PROCEDURE DIVISION.
           DISPLAY "CUSTOMER PROGRAM".
           GOBACK.
