       IDENTIFICATION DIVISION.hey
       PROGRAM-ID. CUSTOMER.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CUSTOMER-ID        PIC X(11).

       PROCEDURE DIVISION.
           DISPLAY "CUSTOMER PROGRAM".
           GOBACK.sada
